Tekla Open API Reference for Tekla Structures 2025
StringOperatorType Enumeration
 The string operator type defines the operators between two string filter expressions.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum StringOperatorType
Public Enumeration StringOperatorType
Members
Member name | Value | Description
IS_EQUAL | 1 |  The "is equal" operator.
IS_NOT_EQUAL | 2 |  The "is not equal" operator.
CONTAINS | 9 |  The "contains" string operator.
NOT_CONTAINS | 10 |  The "not contains" string operator.
STARTS_WITH | 11 |  The "starts with" string operator.
NOT_STARTS_WITH | 12 |  The "not starts with" string operator.
ENDS_WITH | 13 |  The "ends with" string operator.
NOT_ENDS_WITH | 14 |  The "not ends with" string operator.
See Also
Reference
Tekla.Structures.Filtering Namespace